Repository: spootze/wedding-rsvp
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: fi

source: Thank you! Your gift reservation has been successfully recorded!
fi: Kiitos! Varauksesi on tallennettu onnistuneesti.

source: Unfortunately there was an error in processing your reservation
fi: Valitettavasti varauksesi tallentamisessa ilmeni ongelma.

source: Thank you! Your RSVP has been successfully recorded!
fi: Kiitos! Vastauksesi on tallennettu onnistuneesti.

source: Unfortunately it seems that either the name or email has already been used to RSVP
fi: Valitettavasti näyttää siltä, että antamasi nimi tai sähköposti on jo käytetty aikaisempaan vastaukseen.

source: Wedding
fi: Eero ja Pilvi 5.8.2017

source: Location
fi: Paikka

source: Program
fi: Ohjelma

source: Gift register
fi: Lahjalista

source: Welcome!
fi: Tervetuloa!

source: The wedding ceremony will take place in the Temppeliaukio Church at Lutherinkatu 3. The reception is held at Restaurant Sipuli at Kanavanranta 7.
fi: Vihkiminen tapahtuu Temppeliaukion kirkossa Helsingissä, osoitteessa Lutherinkatu 3. Hääjuhlaa vietämme Ravintola Sipulissa, osoitteessa Kanavanranta 7.

source: Shared transportation from the church to the reception has been arranged. You are very welcome to join us with a car. Please note however, that there are limited parking opportunities at the restaurant available.
fi: Kirkolta on yhteinen kuljetus juhlapaikalle. Saapuminen onnstuu myös omalla autolla. Huomioithan kuitenkin, että juhlapaikalla on rajallinen määrä parkkipaikkoja.

source: Temppeliaukio Church
fi: Temppeliaukion kirkko

source: Restaurant Sipuli
fi: Ravintola Sipuli

source: Let's enjoy the evening in style
fi: Nautitaan illasta tyylillä

source: Fill the form below so we know that you're coming! Please let us know latest on Sunday 18.6.
fi: Täytäthän sunnuntai 18.6. mennessä alla olevat tiedot, jotta tiedämme että olet tulossa.

source: Please additionally indicate any allergies or special diets or any additional special requests you might have. In case you would like hold a speech or some other number, you can specify that below or by contacting the best man or maid of honor.
fi: Täytäthän lisäksi alle myös mahdolliset allergiat tai erityisruokavaliot sekä mahdolliset muut erityistoiveet. Jos haluat pitää juhlissa puheen tai muun esityksen, täytähän sen myös tähän tai oletan yhteydessä bestmaniin tai kaasoon.

source: Maid of Honor
fi: Kaaso

source: Name
fi: Nimi

source: Email
fi: Sähköposti

source: Number of quests
fi: Vieraiden lukumäärä

source: Number of guests
fi: Vieraiden lukumäärä

source: Allergies
fi: Allergiat

source: Program requests
fi: Ohjelmanumerot

source: Other special requests
fi: Muut erityistoiveet

source: Register
fi: Varaa

source: Gift Register
fi: Lahjalista

source: If you'd like, you are welcome to help us grow our honeymoon piggybank at FI67 5800 1320 2839 54 or to register a gift below.
fi: Halutessasi voit muistaa meitä kartuttamalla häämatkakassaamme: FI67 5800 1320 2839 54. Lisäksi löydät lahjalistan alla.

source: Item
fi: Toive

source: Quantity
fi: Määrä
